In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [4]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [2]:
left = pd.DataFrame({"key1": ["foo", "foo", "bar"],
                     "key2": ["one", "two", "one"],
                     "lval": pd.Series([1, 2, 3], dtype='Int64')})
right = pd.DataFrame({"key1": ["foo", "foo", "bar", "bar"],
                      "key2": ["one", "one", "one", "two"],
                      "rval": pd.Series([4, 5, 6, 7], dtype='Int64')})
pd.merge(left, right, on=["key1", "key2"], how="outer")

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2  <NA>
3  bar  one     3     6
4  bar  two  <NA>     7

In [5]:
pd.merge(left, right)

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [7]:
pd.merge(left, right, on='key1', suffixes=("_left","_right"))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [8]:
left1 = pd.DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                      "value": pd.Series(range(6), dtype="Int64")})
right1 = pd.DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])

In [9]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [10]:
right1

   group_val
a        3.5
b        7.0

In [16]:
pd.merge(left1,right1, left_on='key', right_index=True)
#pd.merge(left1,right1, left_on='key', right_index=True, how='inner')

pd.merge(left1,right1, left_on='key', right_index=True, how='outer')
pd.merge(left1,right1, left_on='key', right_index=True, how='outer').reset_index(drop=True)

  key  value  group_val
0   a      0        3.5
1   a      2        3.5
2   a      3        3.5
3   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [17]:
lefth = pd.DataFrame({"key1": ["Ohio", "Ohio", "Ohio",
                               "Nevada", "Nevada"],
                      "key2": [2000, 2001, 2002, 2001, 2002],
                      "data": pd.Series(range(5), dtype="Int64")})
lefth

     key1  key2  data
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4

In [24]:
righth_index = pd.MultiIndex.from_arrays(
    [
        ["Nevada", "Nevada", "Ohio", "Ohio", "Ohio", "Ohio"],
        [2001, 2000, 2000, 2000, 2001, 2002]
    ]
)

In [25]:
righth_index

MultiIndex([('Nevada', 2001),
            ('Nevada', 2000),
            (  'Ohio', 2000),
            (  'Ohio', 2000),
            (  'Ohio', 2001),
            (  'Ohio', 2002)],
           )

In [26]:
righth = pd.DataFrame({"event1": pd.Series([0, 2, 4, 6, 8, 10], dtype="Int64",
                                           index=righth_index),
                       "event2": pd.Series([1, 3, 5, 7, 9, 11], dtype="Int64",
                                           index=righth_index)})

In [27]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [28]:
lefth

     key1  key2  data
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4

In [29]:
pd.merge(lefth, righth, left_on=['key1','key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11
3  Nevada  2001     3       0       1

In [30]:
pd.merge(lefth, righth, left_on=['key1','key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11
3  Nevada  2001     3       0       1
4  Nevada  2002     4    <NA>    <NA>
4  Nevada  2000  <NA>       2       3

In [31]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=["a", "c", "e"],
                     columns=["Ohio", "Nevada"]).astype("Int64")
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=["b", "c", "d", "e"],
                      columns=["Missouri", "Alabama"]).astype("Int64")

In [32]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [33]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [36]:
pd.merge(left2,right2, left_index=True, right_index=True)
pd.merge(left2,right2, left_index=True, right_index=True, how='outer')

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
b  <NA>    <NA>         7        8
c     3       4         9       10
d  <NA>    <NA>        11       12
e     5       6        13       14

In [37]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [38]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [39]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
c     3       4         9       10
e     5       6        13       14

In [40]:
left2.join(right2, how='inner')

   Ohio  Nevada  Missouri  Alabama
c     3       4         9       10
e     5       6        13       14

In [41]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
b  <NA>    <NA>         7        8
c     3       4         9       10
d  <NA>    <NA>        11       12
e     5       6        13       14

In [42]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [43]:
right1

   group_val
a        3.5
b        7.0

In [45]:
left1.join(right1)
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [46]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                       index=["a", "c", "e", "f"],
                       columns=["New York", "Oregon"])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [47]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [48]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [49]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
c     3       4         9       10
e     5       6        13       14

In [56]:
left2.join(right2).join(another)
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2      <NA>     <NA>       7.0     8.0
c     3       4         9       10       9.0    10.0
e     5       6        13       14      11.0    12.0

In [52]:
left2.join(right2, how='outer').join(another)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2      <NA>     <NA>       7.0     8.0
b  <NA>    <NA>         7        8       NaN     NaN
c     3       4         9       10       9.0    10.0
d  <NA>    <NA>        11       12       NaN     NaN
e     5       6        13       14      11.0    12.0

In [57]:
left2.join([right2,another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2      <NA>     <NA>       7.0     8.0
c     3       4         9       10       9.0    10.0
e     5       6        13       14      11.0    12.0
b  <NA>    <NA>         7        8       NaN     NaN
d  <NA>    <NA>        11       12       NaN     NaN
f  <NA>    <NA>      <NA>     <NA>      16.0    17.0

In [58]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2      <NA>     <NA>       7.0     8.0
c     3       4         9       10       9.0    10.0
e     5       6        13       14      11.0    12.0

In [59]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [62]:
np.concatenate([arr,arr]) #
#pd.concat
np.concatenate([arr,arr],axis=0) #

np.concatenate([arr,arr],axis=1) #

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [67]:
arr2 = np.arange(15).reshape((3,5))
arr2

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

In [70]:
#np.concatenate([arr,arr2]) 
#np.concatenate([arr,arr2],axis=1)
np.concatenate([arr,arr2],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3,  4],
       [ 4,  5,  6,  7,  5,  6,  7,  8,  9],
       [ 8,  9, 10, 11, 10, 11, 12, 13, 14]])

In [71]:
s1 = pd.Series([0, 1], index=["a", "b"], dtype="Int64")
s2 = pd.Series([2, 3, 4], index=["c", "d", "e"], dtype="Int64")
s3 = pd.Series([5, 6], index=["f", "g"], dtype="Int64")

In [72]:
s1

a    0
b    1
dtype: Int64

In [73]:
s2

c    2
d    3
e    4
dtype: Int64

In [74]:
s3

f    5
g    6
dtype: Int64

In [80]:
pd.concat([s1,s2,s3])
pd.concat([s1,s2,s3], axis=0) #
pd.concat([s1,s2,s3], axis=1) #( )
pd.concat([s1,s2,s3], axis="columns") #( )

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In [81]:
s1

a    0
b    1
dtype: Int64

In [82]:
s3

f    5
g    6
dtype: Int64

In [84]:
s4=pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: Int64

In [85]:
pd.concat([s1,s4])

a    0
b    1
a    0
b    1
f    5
g    6
dtype: Int64

In [87]:
pd.concat([s1,s4], axis=1)

      0  1
a     0  0
b     1  1
f  <NA>  5
g  <NA>  6

In [88]:
pd.concat([s1,s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [89]:
pd.concat([s1,s4], axis=1, join='outer')

      0  1
a     0  0
b     1  1
f  <NA>  5
g  <NA>  6

In [91]:
s1

a    0
b    1
dtype: Int64

In [92]:
s2

c    2
d    3
e    4
dtype: Int64

In [93]:
s3

f    5
g    6
dtype: Int64

In [94]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [95]:
pd.concat([s1,s2,s3], keys=['one','two','three'])

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: Int64

In [96]:
type(pd.concat([s1,s2,s3], keys=['one','two','three']))

pandas.core.series.Series

In [97]:
res=pd.concat([s1,s2,s3], keys=['one','two','three'])
res

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: Int64

In [99]:
res.unstack()
type(res.unstack())

pandas.core.frame.DataFrame

In [103]:
#pd.concat([s1,s2,s3], keys=['one','two','three'])
pd.concat([s1,s2,s3], axis='columns', keys=['one','two','three'])

    one   two  three
a     0  <NA>   <NA>
b     1  <NA>   <NA>
c  <NA>     2   <NA>
d  <NA>     3   <NA>
e  <NA>     4   <NA>
f  <NA>  <NA>      5
g  <NA>  <NA>      6

In [104]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=["a", "b", "c"],
                   columns=["one", "two"])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=["a", "c"],
                   columns=["three", "four"])

In [105]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [106]:
df2

   three  four
a      5     6
c      7     8

In [111]:
df3 = pd.DataFrame(10 + np.arange(4).reshape(2, 2), index=["a", "c"],
                   columns=["one", "five"])

In [112]:
df3

   one  five
a   10    11
c   12    13

In [113]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [114]:
pd.concat([df1,df3])

   one  two  five
a    0  1.0   NaN
b    2  3.0   NaN
c    4  5.0   NaN
a   10  NaN  11.0
c   12  NaN  13.0

In [107]:
pd.concat([df1,df2])#,

   one  two  three  four
a  0.0  1.0    NaN   NaN
b  2.0  3.0    NaN   NaN
c  4.0  5.0    NaN   NaN
a  NaN  NaN    5.0   6.0
c  NaN  NaN    7.0   8.0

In [108]:
pd.concat([df1,df2],axis=0) #

   one  two  three  four
a  0.0  1.0    NaN   NaN
b  2.0  3.0    NaN   NaN
c  4.0  5.0    NaN   NaN
a  NaN  NaN    5.0   6.0
c  NaN  NaN    7.0   8.0

In [109]:
pd.concat([df1,df2],axis=1) #

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [110]:
pd.concat([df1,df2],axis='columns')#

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [116]:
pd.concat([df1,df2],axis='columns', keys=['level1','level2'])#

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [117]:
df1 = pd.DataFrame(np.random.standard_normal((3, 4)),
                   columns=["a", "b", "c", "d"])
df2 = pd.DataFrame(np.random.standard_normal((2, 3)),
                   columns=["b", "d", "a"])

df2

          b         d         a
0 -0.242456  1.352131 -1.060960
1  0.588922  0.077545  1.285685

In [118]:
df1

          a         b         c         d
0 -0.526192  0.008113  1.437148 -0.652537
1 -0.718492  1.078498  0.353677 -1.617944
2 -1.688169  1.022290 -0.098108 -1.270171

In [119]:
pd.concat([df1,df2])

          a         b         c         d
0 -0.526192  0.008113  1.437148 -0.652537
1 -0.718492  1.078498  0.353677 -1.617944
2 -1.688169  1.022290 -0.098108 -1.270171
0 -1.060960 -0.242456       NaN  1.352131
1  1.285685  0.588922       NaN  0.077545

In [121]:
pd.concat([df1,df2]).reset_index(drop=True)

          a         b         c         d
0 -0.526192  0.008113  1.437148 -0.652537
1 -0.718492  1.078498  0.353677 -1.617944
2 -1.688169  1.022290 -0.098108 -1.270171
3 -1.060960 -0.242456       NaN  1.352131
4  1.285685  0.588922       NaN  0.077545

In [122]:
pd.concat([df1,df2], ignore_index=True)

          a         b         c         d
0 -0.526192  0.008113  1.437148 -0.652537
1 -0.718492  1.078498  0.353677 -1.617944
2 -1.688169  1.022290 -0.098108 -1.270171
3 -1.060960 -0.242456       NaN  1.352131
4  1.285685  0.588922       NaN  0.077545

In [123]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan],
              index=["f", "e", "d", "c", "b", "a"])
b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.],
              index=["a", "b", "c", "d", "e", "f"])

In [124]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [125]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [127]:
pd.isna(a)

f     True
e    False
d    False
c    False
b    False
a     True
dtype: bool

In [128]:
#a   -> b  
#np.where(, , )

np.where(pd.isna(a), b, a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [129]:
a.combine_first(b) #a   -> b

a    0.0
b    4.5
c    3.5
d    0.0
e    2.5
f    5.0
dtype: float64

In [130]:
df1 = pd.DataFrame({"a": [1., np.nan, 5., np.nan],
                    "b": [np.nan, 2., np.nan, 6.],
                    "c": range(2, 18, 4)})
df2 = pd.DataFrame({"a": [5., 4., np.nan, 3., 7.],
                    "b": [np.nan, 3., 4., 6., 8.]})

In [131]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [132]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [133]:
#df1, df2 
#df1  df2

In [134]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [136]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(["Ohio", "Colorado"], name="state"),
                    columns=pd.Index(["one", "two", "three"],
                    name="number"))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [137]:
data.stack() #dataframe -> series

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [138]:
data.stack().unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [139]:
res=data.stack()
res

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [140]:
res.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [141]:
D

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [142]:
res.unstack(level=1)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [144]:
res.unstack(level='state')
res.unstack(level='number')

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [145]:
s1 = pd.Series([0, 1, 2, 3], index=["a", "b", "c", "d"], dtype="Int64")
s2 = pd.Series([4, 5, 6], index=["c", "d", "e"], dtype="Int64")
data2 = pd.concat([s1, s2], keys=["one", "two"])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [146]:
s1

a    0
b    1
c    2
d    3
dtype: Int64

In [147]:
s2

c    4
d    5
e    6
dtype: Int64

In [148]:
data2.unstack()

        a     b  c  d     e
one     0     1  2  3  <NA>
two  <NA>  <NA>  4  5     6

In [149]:
data2.unstack().stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [150]:
data2.unstack().stack(dropna=False)

one  a       0
     b       1
     c       2
     d       3
     e    <NA>
two  a    <NA>
     b    <NA>
     c       4
     d       5
     e       6
dtype: Int64

In [152]:
res

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [153]:
df = pd.DataFrame({"left": res, "right": res + 5},
                  columns=pd.Index(["left", "right"], name="side"))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [154]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [156]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [159]:
data=data.reindex(columns=['two','three','one'])
data

number    two  three  one
state
Ohio        1      2    0
Colorado    4      5    3

In [166]:
data = {
    "": ["", "", "", "", "", "", "", ""],
    "": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "": ["", "", "", "", "", "", "", ""]
}
cols = ["", "", "", ""]

In [167]:
data

{'': ['', '', '', '', '', '', '', ''],
 '': ['2015', '2010', '2005', '2015', '2010', '2005', '2015', '2010'],
 '': [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
 '': ['', '', '', '', '', '', '', '']}

In [168]:
columns

['', '', '', '']

NameError: name 'feature' is not defined

In [172]:
#pd.DataFrame(data, columns=cols)

0    2015  9904312  NaN
1    2010  9631482  NaN
2    2005  9762546  NaN
3    2015  3448737  NaN
4    2010  3393191  NaN
5    2005  3512547  NaN
6    2015  2890451  NaN
7    2010   263203  NaN

In [173]:
data = {
    "": ["", "", "", "", "", "", "", ""],
    "": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "": ["", "", "", "", "", "", "", ""]
}
columns = ["", "", "", ""]
df1 = pd.DataFrame(data, columns=columns)
df1

0    2015  9904312
1    2010  9631482
2    2005  9762546
3    2015  3448737
4    2010  3393191
5    2005  3512547
6    2015  2890451
7    2010   263203

In [174]:
df1.pivot('','','')
#pivot(, , )

C:\Users\user\AppData\Local\Temp\ipykernel_14928\69723028.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  df1.pivot('','','')

       2005       2010       2015

  3512547.0  3393191.0  3448737.0
  9762546.0  9631482.0  9904312.0
        NaN   263203.0  2890451.0

In [177]:
df1

0    2015  9904312
1    2010  9631482
2    2005  9762546
3    2015  3448737
4    2010  3393191
5    2005  3512547
6    2015  2890451
7    2010   263203

In [181]:
df1.set_index(['', ''])

 2015  9904312
   2010  9631482
   2005  9762546
 2015  3448737
   2010  3393191
   2005  3512547
 2015  2890451
   2010   263203

In [182]:
df1.set_index(['', '']).stack()

  2015      9904312

    2010      9631482

    2005      9762546

  2015      3448737

    2010      3393191

    2005      3512547

  2015      2890451

    2010       263203

dtype: object

In [185]:
df1.set_index(['', ''])

 2015  9904312
   2010  9631482
   2005  9762546
 2015  3448737
   2010  3393191
   2005  3512547
 2015  2890451
   2010   263203

In [186]:
df1.set_index(['', ''])['']

  2015    9904312
    2010    9631482
    2005    9762546
  2015    3448737
    2010    3393191
    2005    3512547
  2015    2890451
    2010     263203
Name: , dtype: int64

In [187]:
df1.set_index(['', ''])[['']]

 2015  9904312
   2010  9631482
   2005  9762546
 2015  3448737
   2010  3393191
   2005  3512547
 2015  2890451
   2010   263203

In [188]:
df1.set_index(['', ''])[['']].unstack()

       2005       2010       2015

  3512547.0  3393191.0  3448737.0
  9762546.0  9631482.0  9904312.0
        NaN   263203.0  2890451.0

In [189]:
df1.pivot('','','')

C:\Users\user\AppData\Local\Temp\ipykernel_14928\1780119059.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  df1.pivot('','','')

       2005       2010       2015

  3512547.0  3393191.0  3448737.0
  9762546.0  9631482.0  9904312.0
        NaN   263203.0  2890451.0

In [191]:
df1

0    2015  9904312
1    2010  9631482
2    2005  9762546
3    2015  3448737
4    2010  3393191
5    2005  3512547
6    2015  2890451
7    2010   263203

In [192]:
df1.pivot(['',''], '', '')

C:\Users\user\AppData\Local\Temp\ipykernel_14928\3713867857.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  df1.pivot(['',''], '', '')

           2005       2010       2015

   3512547.0  3393191.0  3448737.0
   9762546.0  9631482.0  9904312.0
            NaN   263203.0  2890451.0

In [194]:
df1

0    2015  9904312
1    2010  9631482
2    2005  9762546
3    2015  3448737
4    2010  3393191
5    2005  3512547
6    2015  2890451
7    2010   263203

In [195]:
#df1.pivot('', '', '')
# 2015      
#  1

In [ ]:
df1

In [196]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [ ]:
   DATA1   DATA2
A   8        80 
B

In [198]:
groups=df2.groupby('key1')

In [199]:
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [203]:
groups.get_group('A')

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
4    A  one      5     50

In [206]:
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [205]:
groups.sum()

C:\Users\user\AppData\Local\Temp\ipykernel_14928\1171057664.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [207]:
#groups=df2.groupby('key1')
#df2.groupby(df2.key1)

In [208]:
df2
#df2 data1  ,   key1

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [210]:
df2.data1
df2.data1.groupby(df2.key1).sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [213]:
df2.groupby('key1').sum()['data1']

C:\Users\user\AppData\Local\Temp\ipykernel_14928\860493886.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby('key1').sum()['data1']

key1
A    8
B    7
Name: data1, dtype: int64

In [216]:
df2.groupby('key1')['data1'].sum() #

key1
A    8
B    7
Name: data1, dtype: int64

In [217]:
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [221]:
df2.data1.groupby(df2.key1).sum()
df2.data1.groupby([df2.key1, df2.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [222]:
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [ ]:
     one   two
A     6     2
B     3     4

In [223]:
df2.data1.groupby([df2['key1'], df2['key2']]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [226]:
df2.data1.groupby([df2['key1'], df2['key2']]).sum().unstack()
df2.data1.groupby([df2['key1'], df2['key2']]).sum().unstack('key2')
df2.data1.groupby([df2['key1'], df2['key2']]).sum().unstack('key1')

key1  A  B
key2
one   6  3
two   2  4

In [227]:
df1
#,   
#              2005   2010  2015
#            
#

0    2015  9904312
1    2010  9631482
2    2005  9762546
3    2015  3448737
4    2010  3393191
5    2005  3512547
6    2015  2890451
7    2010   263203

In [231]:
df1..groupby([df1[''],df1['']]).sum()
df1..groupby([df1[''],df1['']]).sum().unstack('')

      2005     2010      2015

  3512547  3393191   3448737
  9762546  9894685  12794763

In [232]:
df1 = pd.DataFrame({
    '': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '': ['', '', '', '', '', '', '']
}, columns=['', ''])
df1

0  1001
1  1002
2  1003
3  1004
4  1005
5  1006
6  1007

In [233]:
df2 = pd.DataFrame({
    '': [1001, 1001, 1005, 1006, 1008, 1001],
    '': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['', ''])
df2

0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [234]:
pd.merge(df1,df2)

0  1001     10000
1  1001     20000
2  1001     30000
3  1005     15000
4  1006     5000

In [235]:
pd.merge(df1,df2,how='outer')

0  1001      10000.0
1  1001      20000.0
2  1001      30000.0
3  1002         NaN
4  1003          NaN
5  1004          NaN
6  1005      15000.0
7  1006      5000.0
8  1007          NaN
9  1008  NaN  100000.0

In [237]:
df1

0  1001
1  1002
2  1003
3  1004
4  1005
5  1006
6  1007

In [238]:
df2

0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [236]:
pd.merge(df1,df2,how='right')

0  1001      10000
1  1001      20000
2  1005      15000
3  1006      5000
4  1008  NaN  100000
5  1001      30000

In [239]:
df1 = pd.DataFrame({
    '': ['setosa', 'setosa', 'virginica', 'virginica'],
    '': [1.4, 1.3, 1.5, 1.3]},
    columns=['', ''])
df1

0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

In [240]:
df2 = pd.DataFrame({
    '': ['setosa', 'virginica', 'virginica', 'versicolor'],
    '': [0.4, 0.3, 0.5, 0.3]},
    columns=['', ''])
df2

0      setosa   0.4
1   virginica   0.3
2   virginica   0.5
3  versicolor   0.3

In [ ]:
	 	   	
0	setosa	 1.4	    0.4
1	setosa	 1.3      	0.4
2	virginica	1.5 	0.3
3	virginica	1.5 	0.5
4	virginica	1.3 	0.3
5	virginica	1.3 	0.5

In [241]:
pd.merge(df1, df2)

0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

In [245]:
df1 = pd.DataFrame({
    '': ['', '', ''],
    '': ['2018-01-01', '2018-01-02', '2018-01-01'],
    '': ['20000', '30000', '100000']})
df1

0    2018-01-01   20000
1    2018-01-02   30000
2    2018-01-01  100000

In [254]:
df2 = pd.DataFrame({
    '': ['', ''],
    '': ['', '']})
df2

# df2 = pd.DataFrame({
#     '': ['', ''],
#     '': ['', '']})
# df2

0
1

In [256]:
pd.merge(df1,df2, on='')

               _x _y
0    2018-01-01   20000
1    2018-01-02   30000
2    2018-01-01  100000

In [ ]:
#  :
#   -  
# wikidocs.net -  
# https://datascienceschool.net/intro.html   #

In [270]:
df1 = pd.DataFrame({
    '': ['setosa', 'setosa', 'virginica', 'virginica'],
    '': [1.4, 1.3, 1.5, 1.3]},
    columns=['', ''])
df1

0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

In [271]:
df2 = pd.DataFrame({
    '': ['setosa', 'virginica', 'virginica', 'versicolor'],
    '': [0.4, 0.3, 0.5, 0.3]},
    columns=['', ''])
df2

0      setosa   0.4
1   virginica   0.3
2   virginica   0.5
3  versicolor   0.3

In [272]:
pd.merge(df1,df2, on='')

0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

In [ ]:
#pivot_table = pivot + groupby

In [260]:
df1 = pd.DataFrame({
    '': ['', '', ''],
    '': [1, 2, 3]})
df1

0     1
1     2
2     3

In [261]:
df2 = pd.DataFrame({
    '': ['', '', ''],
    '2': [4, 5, 6]})
df2

     2
0      4
1      5
2      6

In [263]:
pd.merge(df1,df2, left_on='', right_on='' )

         2
0     1      4
1     1      5
2     2      6
3     3      6

In [273]:
df1 = pd.DataFrame({
    '': ['', '', '', '', ''],
    '': [2000, 2005, 2010, 2000, 2005],
    '': [9853972, 9762546, 9631482, 3655437, 3512547]})
df1

0    2000  9853972
1    2005  9762546
2    2010  9631482
3    2000  3655437
4    2005  3512547

In [274]:
df2 = pd.DataFrame(
    np.arange(12).reshape((6, 2)),
    index=[['', '', '', '', '', ''],
           [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['1', '2'])
df2

         1  2
 2000     0     1
   2005     2     3
 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

In [276]:
pd.merge(df1,df2, left_on=['',''], right_index=True)

                1  2
0    2000  9853972     4     5
1    2005  9762546     6     7
2    2010  9631482     8     9
3    2000  3655437     0     1
4    2005  3512547     2     3

In [277]:
df1 = pd.DataFrame(
    [[1., 2.], [3., 4.], [5., 6.]],
    index=['a', 'c', 'e'],
    columns=['', ''])
df1

a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [278]:
df2 = pd.DataFrame(
    [[7., 8.], [9., 10.], [11., 12.], [13, 14]],
    index=['b', 'c', 'd', 'e'],
    columns=['', ''])
df2

b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [ ]:
"""
			
a	1.0	2.0	NaN	NaN
b	NaN	NaN	7.0	8.0
c	3.0	4.0	9.0	10.0
d	NaN	NaN	11.0	12.0
e	5.0	6.0	13.0	14.0
"""

In [ ]:
merge
join

In [281]:
pd.merge(df1, df2, left_index = True, right_index = True)
pd.merge(df1, df2, left_index = True, right_index = True,how='outer')

a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [283]:
df1

a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [284]:
df2

b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [282]:
df1.join(df2)

a  1.0  2.0   NaN   NaN
c  3.0  4.0   9.0  10.0
e  5.0  6.0  13.0  14.0

In [285]:
df1.join(df2, how="outer")

a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [290]:
pd.concat([df1,df2])
pd.concat([df1,df2],axis=1, sort=True)

a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [291]:
pd.concat([df1,df2],axis=0, sort=True)

a   NaN   NaN  2.0  1.0
c   NaN   NaN  4.0  3.0
e   NaN   NaN  6.0  5.0
b   8.0   7.0  NaN  NaN
c  10.0   9.0  NaN  NaN
d  12.0  11.0  NaN  NaN
e  14.0  13.0  NaN  NaN